/*
* =========================================================================================================
* | 1번 (2026.2.3)
* | 게임 이름에 "Christmas" 또는 "Santa"가 포함된 게임의 game_id(게임ID), name(게임이름), year(발매연도)을
* | 찾는 쿼리를 작성해주세요.
* =========================================================================================================
*/
SELECT game_id, name, year
FROM games
WHERE name LIKE '%Christmas%' or name LIKE '%Santa%';


/*
* =========================================================================================================
* | 2번 (2026.2.5)
* | 서식지 별로 어떤 펭귄이 사는지 조사하기 위해 펭귄의 종과 서식지를 출력하는 쿼리를 작성해주세요.
* | 각 서식지에 대해서 펭귄의 종은 중복 없이 1번씩만 나와야 합니다.
* =========================================================================================================
*/
SELECT species, island
FROM penguins
GROUP BY island,species
ORDER BY island;


/*
* ===============================================================================================================================
* | 3번 (2026.2.6)
* | 17세 미만 학생이 DVD 대여점에 혼자와서는 대여할 수 없는 영화 중 제목이 모음(’A’, ‘E’, ‘I’, ‘O’, ‘U’)로 끝나지 않는 영화를 찾고 싶습니다.
* |  영화 제목을 출력하는 쿼리를 작성해주세요. 
* ===============================================================================================================================
*/
WITH seventeens AS (SELECT title
FROM film
WHERE rating = 'R' or rating = 'NC-17')

SELECT title
FROM seventeens
WHERE title NOT LIKE '%A' 
  AND title NOT LIKE '%E' 
  AND title NOT LIKE '%I' 
  AND title NOT LIKE '%O' 
  AND title NOT LIKE '%U'

# --- 더 쉬운 풀이 방법 ---
SELECT title
FROM film
WHERE RIGHT(title, 1) NOT IN ('A', 'E', 'I', 'O', 'U');

# --- 더 쉬운 풀이 방법2 ---
SELECT title
FROM film
WHERE SUBSTRING(title, -1) NOT IN ('A', 'E', 'I', 'O', 'U');


/*
* =========================================================================================================
* | 1번 (2026.2.3)
* | 게임 이름에 "Christmas" 또는 "Santa"가 포함된 게임의 game_id(게임ID), name(게임이름), year(발매연도)을
* | 찾는 쿼리를 작성해주세요.
* =========================================================================================================
*/



/*
* =========================================================================================================
* | 1번 (2026.2.3)
* | 게임 이름에 "Christmas" 또는 "Santa"가 포함된 게임의 game_id(게임ID), name(게임이름), year(발매연도)을
* | 찾는 쿼리를 작성해주세요.
* =========================================================================================================
*/
# --- 더 쉬운 풀이 방법 ---
# 서브 쿼리 없이 HAVING 이용하기

# 다시 풀어보기

--- customer_id 는 거래 수 만큼 생성이 되므로 is_returned 가 true 여도 주문만 있다면 customer_id 값은 있음
---> 따라서 where is_returned = false 를 서브쿼리로 안 써도 된다.
